[
  {
    "path": "posts/2021-07-17-assignvastchallenge/",
    "title": "Data Visualization and Analysis for the Kronos Incident Investigation Using R",
    "description": "VAST Challenge 2021 Mini-Challenge 2.",
    "author": [
      {
        "name": "DONG Fang (Regina)",
        "url": "https://www.linkedin.com/in/reginadongf/"
      }
    ],
    "date": "2021-07-17",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Background1.1 Case overview\r\n1.2 Requirement for Mini-Challenge 2\r\n\r\n\r\n1. Background\r\n1.1 Case overview\r\nGAStech is a Tethys-based company having been operating a natural gas production site in the island country of Kronos for over 20 years. It has produced remarkable profits and developed strong relationships with the government of Kronos, but has not been as successful in demonstrating environmental stewardship.\r\nIn January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem.\r\nThis case is designed aim at helping the law enforcement from Kronos and Tethys investigate the incident by using data visualization techniques. There are 3 challenges in VAST Challenge 2021 focusing on different aspects of case analysis. In this report we concentrated on visualization and analysis for Mini-Challenge 2.\r\n1.2 Requirement for Mini-Challenge 2\r\nMany of the Abila, Kronos-based employees of GAStech have company cars which are approved for both personal and business use. Those who do not have company cars have the ability to check out company trucks for business use, but these trucks cannot be used for personal business. The vehicles are installed with GPS tracked periodically as long as they are moving. Besides, in order to promote local businesses, Kronos based companies provide a Kronos Kares benefit card to GASTech employees giving them discounts and rewards in exchange for collecting information about their credit card purchases and preferences as recorded on loyalty cards.\r\nNow the vehicle tracking data for the two weeks prior to the incident, car assignment list, transaction records in credit card and loyal card are available for analyzing.\r\nThe challenges to be dealt with are listed below:\r\nNo.\r\nQuestion\r\n1\r\nUsing just the credit and loyalty card data, identify the most popular locations, and when they are popular. What anomalies do you see? What corrections would you recommend to correct these anomalies?\r\n2\r\nAdd the vehicle data to your analysis of the credit and loyalty card data. How does your assessment of the anomalies in question 1 change based on this new data? What discrepancies between vehicle, credit, and loyalty card data do you find?\r\n3\r\nCan you infer the owners of each credit card and loyalty card? What is your evidence? Where are there uncertainties in your method? Where are there uncertainties in the data?\r\n4\r\nGiven the data sources provided, identify potential informal or unofficial relationships among GASTech personnel. Provide evidence for these relationships.\r\n5\r\nDo you see evidence of suspicious activity? Identify 1- 10 locations where you believe the suspicious activity is occurring, and why.\r\nThe detailed information and all the data needed for Mini-challenge 2 is available in VAST Challenge 2021 official website.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-17T15:13:15+08:00",
    "input_file": "assignvastchallenge.knit.md"
  },
  {
    "path": "posts/2021-06-18-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "Visual Analytics and Applications - Assignment2",
    "author": [
      {
        "name": "DONG Fang (Regina)",
        "url": "https://www.linkedin.com/in/reginadongf/"
      }
    ],
    "date": "2021-06-18",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Critiques for Original Visualization1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2. Alternative Design2.1 Sketch\r\n2.2 Advantages of proposed design\r\n\r\n3. Step-by-step Guide3.1 Data preparation steps\r\n3.2 Data visualization steps3.2.1 Create bubble plot in Tableau\r\n3.2.2 Create bar chart in Tableau\r\n3.2.3 Create line chart in Tableau\r\n3.2.4 Create dashboard in Tableau\r\n\r\n\r\n4. Final Visualization\r\n5. Major Observations\r\n\r\n1. Critiques for Original Visualization\r\nSingapore is a country with large volumes of import and export transactions with various countries/regions. In order to show the merchandise trade of ten major trading partners, below graph was originally designed as the visualization of import and export trade data provided by Department of Statistics, Singapore (DOS).\r\nFig.1 Original Visualization\r\nHowever, this graph is not a good visualization sample for this topic. I criticized above graph from two aspects, clarity and aesthetics, and explained the reason why it’s not good enough.\r\n1.1 Clarity\r\nClarity is to describe how quickly and effectively it imparts to the audience an accurate understanding of some fundamental truth about the real world. For the original graph, there are several points that I think is not meet the requirement of clarity.\r\nNo\r\nCritiques\r\n1\r\nOverlapped bubbles with opaque color and tag, make it difficult to see the size of some bubbles, such as Malaysia bubble that is almost blocked by EU and United States, or Korea bubble which is mostly covered by Japan. The audience can’t tell how big the bubbles of Malaysia and Korea are.\r\n2\r\nCan’t clearly tell whether some bubble centers fall in the area of net imports or net exports, cause some centers are covered or too close to the diagonal line. For example, the center of EU is blocked by United States, the center of Korea is blocked by Japan, and the center of Mainland China almost lies on the diagonal line, so it’s hard to determine which part of area the three countries belong to.\r\n3\r\nIt does not show what the figure on the labels exactly stand for. If it represents the total merchandise trade value, then no label shows specific values of trade surplus and deficit for each country, which is important information for the topic. The original graph only use some icons to show the top net exporter and importer without showing specific net trade amount between the singapore and partners\r\n4\r\nNo proper title or lead-in verbiage shows which period the graph and data represents. A proper title is very important to show the key topic of a graph, but this graph even don’t have a title. The lead-in verbiage also does not show the period of the graph.\r\n5\r\nNo option could let the audience select specific period to see the trade performance with different countries/regions in that period. The graph could only show the trade performance in a fixed period, but what if the audience want to see the data of a specific period.\r\n1.2 Aesthetic\r\nThe point of Aesthetic is to make the graph looks beautiful. Although the standard of “beauty” is different for everyone, at least we can think the visualization is more beautiful when the graph looks neat and clear, then audiences would like to pay more attention to the graph. In that case, some subtle adjustment is always matter, for example, font and color choices for the graph. Thus, I have came up with several points on why the original graph is not beautiful enough.\r\nNo.\r\nCritiques\r\n1\r\nThe bubbles and labels are represented by too many colors. Each bubble is linked with a label showing name of country/region and certain figure. But all bubbles and labels are in different colors and block each other, which makes the entire graph look too fancy and distracting. So the audience can’t focus on the key information the figure want to convey.\r\n2\r\nSome icons are not necessary to for the graph. For example the two icons next to the start point of axes. It won’t provide much valuable information but will distract the audience.\r\n3\r\nThe font color and size of the two paragraphs of text in the graph are different, which makes the graph look less concise. Both paragraphs of text represent some kind of annotation for the graph, but expressed in different font colors and sizes. And the text at the bottom is even placed in a blue box. All these inconsistencies will make the entire graph look untidy and distract the audience.\r\n2. Alternative Design\r\n2.1 Sketch\r\nThe following picture shows the initial design sketch for the visualization of above topic:\r\nFig.2 Sketch of the alternative design\r\n2.2 Advantages of proposed design\r\nThe advantages and issues the proposed design try to overcome are listed below:\r\nNO.\r\nAspect\r\nAdvantages\r\n1\r\nClarity\r\nAdjust the size of bubbles and set some extend of transparency for the bubble colors, and show the label for bubbles only when the mouse hover over the bubbles, which could reduce the overlapped area, and the transparency makes it clear to see the size even if bubbles are overlapped.\r\n2\r\nClarity\r\nUse color to show whether the partner is net exporter or net importer. The bubbles and bar chart are blue when export trade amount of specific partner exceed import, otherwise they are in red color. In this case the audience could easily distinguish net exporters and net importers. Besides, the color saturation indicates how high the absolute value of each partner’s trade surplus or deficit is.\r\n3\r\nClarity\r\nAn extra bar chart is designed to show the concrete net trade amount and its rank. The bar chart could clearly show the net trade amount of each countries and the trading partners are sorted in descending order of the net trade values.\r\n4\r\nClarity\r\nAdd proper graph title, lead-in verbiage and reference line. This proposed design includes a proper title and description of the background, purpose and currency of visualization. It will give audiences a clearer recognition of information passed by the graph. Besides, some reference lines are added to show the average of factors.\r\n5\r\nClarity\r\nThe interactivity of the graph could give audiences the option to choose specific years. Set an interactive filter to see the trade performance in a specific year, also set the animation to show the track of value changes along with year changes, so that audiences could compare the amount between years.\r\n6\r\nClarity\r\nThe tooltip includes the specific amount and rank of trade for each trading partner, as well as the line chart of export and import amount during 2011 to 2020. Audience could see the tooltip if they want to know more details about the trade performance. Besides, the line chart can give audiences an intuitive feeling of how the values of export and import trade changes over time.\r\n7\r\nAesthetic\r\nSimple and consistent color scheme for the entire graph. The selected colors for the plot area look comfortable, and grid lines are in light gray which won’t distract the audience attention. Besides, the color scheme of bubble plot is aligned with the color used in bar chart and line chart.\r\n3. Step-by-step Guide\r\n3.1 Data preparation steps\r\nNO.\r\nStep\r\nAction\r\n1\r\nUnzip the zipped folder downloaded\r\nRight click on the zip package and select “Unzip” all and get the raw data workbook “outputFile”\r\n2\r\nFilter data for imports\r\nOpen the workbook called “outputFile”, select worksheet “T1” and select row 6, then click on Home pane -> Sort & Filter icon -> Filter Fig.3 Filter the data\r\n3\r\nSelect the target ten trading partners for imports\r\nClick on the triangle at the bottom right corner of cell A6, first uncheck “(Select All)”, then check the 10 target countries/regions to filter them out Fig.4 Select target trading partners\r\n4\r\nCopy out the target countries/regions with import values\r\nAfter filtering, select cells from A6 to A81, press Ctrl+C on Keyboard, and paste in the A1 cell in a new workbook by pressing Ctrl+V\r\n5\r\nSelect the import data between Jan 2011 to Dec 2020\r\nSelect cells from PF6 to TU81, press Ctrl+C on Keyboard, and paste in the B1 cell in the same workbook as last step by pressing Ctrl+V, name this worksheet as “Import” Fig.5 The “Import” sheet after pasting\r\n6\r\nPrepare export sheet\r\nClick on the + button next to “Import” sheet and name the new sheet as “Export” Fig.6\r\n7\r\nFilter the target ten trading partners for exports\r\nRepeat step 2 and 3 for worksheet “T2” of “outputFile”\r\n8\r\nCopy out the target countries/regions with export values\r\nAfter filtering, select cells from A6 to A79, press Ctrl+C on Keyboard, and paste in the A1 cell in a “Export” sheet by pressing Ctrl+V\r\n9\r\nSelect the export data between Jan 2011 to Dec 2020\r\nSelect cells from PF6 to TU79, press Ctrl+C on Keyboard, and paste in the B1 cell in the same sheet as last step by pressing Ctrl+V, save this workbook as “data_cleaned”\r\n10\r\nTransform Million Dollars to Thousand Dollars for European Union import amount\r\nIn the “Import” sheet of “data_cleaned” workbook, type in 1000 in cell A20, copy A20 by pressing Ctrl+C, and select cells from B2 to DQ2, then click on Home pane -> Paste button -> Paste Special…, and select options as following screenshot in the pop up window. Fig.7 Paste Special\r\n11\r\nTransform Thousand Dollars to Dollars for import amount\r\nCopy A20 by pressing Ctrl+C, and select cells from B2 to DQ12, then click on Home pane -> Paste button -> Paste Special…, and select options as step 10. After done this step, clear cell A20\r\n12\r\nTransform Million Dollars to Thousand Dollars for European Union export amount\r\nRepeat step 10 for “Export” sheet\r\n13\r\nTransform Thousand Dollars to Dollars for export amount\r\nRepeat step 11 for “Export” sheet\r\n14\r\nOpen Tableau Prep Builder, and drag “data_cleaned” worksheet to the pane\r\nFig.8 Drag the data file to the pane of Tableau Prep Builder\r\n15\r\nIn the opened window, drag “Export” sheet to the workflow pane\r\nFig.9 Drag “Export” sheet to the pane\r\n16\r\nClick on “+” button next to “Export” sheet icon then click “Pivot”\r\nFig.10\r\n17\r\nIn the Settings pane below, select all fields with name consisting of “year month” and drag to the Pivoted Fields pane\r\nFig.11\r\n18\r\nIn the Pivot Result Pane, click on the “Abc” sign on the up left corner of the 1st field, and select data type “Date”, then do the same thing for the 2nd field and change the data type as “Number (Whole)”\r\nFig.12 Change the data type\r\n19\r\nDrag “Import” sheet to the workflow pane\r\nRepeat step 17 and 18\r\n20\r\nOn the workflow pane above, click and hold on “Pivot 1” icon, then drag it to the “Join” area when the mouse hover over “Pivot 2” icon\r\nFig.13 Join the two sheet\r\n21\r\nBelow the Settings pane, click the “+” button, set the applied join Clauses using Pivot1Name and Variables fields, and set join type as full by click the to circle as the right side screenshot shows\r\nFig.14\r\n22\r\nIn the Join Results pane, double click the name of the 2nd field and type in “Import”, as the right side screenshot shows\r\nFig.15 Change the field name\r\n23\r\nAs the right side screenshot shows, remove two fields by right click on the field and select “Remove”\r\nFig.16 Remove duplicate fields\r\n24\r\nRight click on the last field and select Split Values -> Automatic Split, then remove the last column as step 23\r\nFig.17 Auto-split the last field\r\n25\r\nAs step 22, change the 2st field name as “Date”, and the 4th as “Export”\r\nFig.18 The final result after revising field names\r\n26\r\nOn the workflow pane, click the “+” button next to “Join 1” sign and select Output\r\nFig.19 Export the prepared data\r\n27\r\nEdit the output parameters on the output pane as the right side screenshot shows, click Run Flow button to save the prepared data file in csv format, named as “data_stacked.csv”\r\nFig.20 Export the prepared data for visualization\r\n3.2 Data visualization steps\r\n3.2.1 Create bubble plot in Tableau\r\nNO.\r\nStep\r\nAction\r\n1\r\nLaunch Tableau Desktop, from the local directory where the “data_stacked.csv” is saved, drag and drop into the homepage as shown,keep default settings\r\nFig.21 Import data into Tableau\r\n2\r\nClick on Sheet 1, in Data pane, drag and drop Export to Columns, Import to Rows, Country to Detail box in Marks pane\r\nFig.22 Set the plot data\r\n3\r\nClick Analysis -> Create Calculated Field, in the pop out window, typing the name and formula as the right side screenshot shows, then click on OK\r\nFig.23 Create the 1st calculation field\r\n4\r\nRepeat step3 to create other calculation fields need, the name and formula for each field is shown as the screenshots\r\nFig.24 Create the rest calculation fields\r\n5\r\nDrag and drop Total Trade on Size box and Net trade on Colour box, in Marks pane\r\nFig.25 Set the plot size and colour\r\n6\r\nClick on the “Automatic” drop list in Marks pane and select Circle, then drag and drop Country on Label box\r\nFig.26 Set the plot shape and label\r\n7\r\nDrag and drop Date in Filters pane and proceed as shown by screenshots\r\nFig.27 Set the filter\r\n8\r\nRight click on YEAR(Date) in Filters pane and select Show Filter\r\nFig.28 Show filter\r\n9\r\nClick the black triangle on the top right corner of filter, first select “Edit Tile…”, and type in “Select a year” in the window popping up then click OK button\r\nFig.29 Change the filter name\r\n10\r\nRepeat last step but select “Single Value (list)”\r\nFig.30 Change the filter type\r\n11\r\nDouble click on Color Legend on the right side and edit colours in the popping up window as screenshot shows\r\nFig.31 Change the bubble plot colour scale\r\n12\r\nClick Colour box in Marks pane and change the opacity and border as the screenshot shows\r\nFig.32 Change the colour setting details\r\n13\r\nClick Size box in Marks pane and move the slider to the position as the screenshot shows\r\nFig.33 Change the bubble size\r\n14\r\nClick Format -> Animations and turn on animations\r\nFig.34 Turn on animations\r\n15\r\nPress “Ctrl” key and click on Deficit, Surplus, Ranking of export, Ranking of import, Ranking of Total, Export, Import, drag and drop Tooltip box on Marks pane\r\nFig.35 Set tooltip\r\n16\r\nClick Format -> Font… -> Fields and select AGG(Total trade), click Pane tab\r\nFig.36 Open format setting pane\r\n17\r\nSet the number format as right side screenshot shows\r\nFig.37 Set number format for one field\r\n18\r\nRepeat step16 and select the fields one by one as shown in the screenshot, then repeat step17 to set the same format for these fields\r\nFig.38 Set number format for other fields\r\n19\r\nRight click on the “Import” axis and select Add Reference Line, and set the reference line in the window popping up, as the screenshot shows, then repeat this step for the “Export” axis\r\nFig.39 Add reference line\r\n3.2.2 Create bar chart in Tableau\r\nNO.\r\nStep\r\nAction\r\n20\r\nClick “New worksheet” button to add Sheet 2\r\nFig.40 Add new worksheet for bar chart\r\n21\r\nIn Sheet 2 -> Data pane, drag and drop Net trade to Columns, Country to Rows, Net trade to Colour box in Marks pane\r\nFig.41 Set plot fields and plot colour for the bar chart\r\n22\r\nDouble click on the Colour Legend on the right side and edit Colours in the popping up window as screenshot shows\r\nFig.42 Change the bar chart colour scale\r\n23\r\nSort the sorting of Country by click the button shown in the screenshot\r\nFig.43 Sort the countries/regions by descending order\r\n24\r\nRepeat step 7 and 8 for Sheet 2 to set filter\r\n\r\n25\r\nRepeat step 16 and 17 for Net trade in Sheet 2 set the number format\r\n\r\n26\r\nRepeat step 19 for “Net trade” axis to add reference line\r\n\r\n27\r\nDouble click “Net trade” axis and rename the axis as shown in the screenshot\r\nFig.44 Rename the “Net trade” axis\r\n28\r\nDrag and drop Net trade to Label box in Marks pane, then click Label box and click “Min/Max” as highlighted in the screenshot\r\nFig.45 Add the data label to the country/region with min and max net trade amount\r\n3.2.3 Create line chart in Tableau\r\nNO.\r\nStep\r\nAction\r\n29\r\nRepeat step 20 to add Sheet 3\r\n\r\n30\r\nIn Sheet 3 -> Data pane, drag and drop Date to Columns, Export to Rows, then drag and drop Import to the “Export” axis as shown in the screenshot\r\nFig.46 Set plot fields for the line chart\r\n31\r\nRight click YEAR(Date) and select continuous Year\r\nFig.47 Set YEAR as continuous format\r\n32\r\nDrag and drop Measure Values to the position as shown in the screenshot, to add the dual axis\r\nFig.48 Add the dual axis\r\n33\r\nRight click on the dual axis and check “Synchronise Axis”, then right click again and uncheck “Show Header”\r\nFig.49 Hide the dual axis\r\n34\r\nClick the second Measure Values tab in Marks pane, select “Circle” from the drop list of plot type\r\nFig.50 Change the plot type\r\n35\r\nClick the first Measure Values tab in Marks pane, drag and drop Measures Names to the Label box in Marks pane\r\nFig.51 Set the line label\r\n36\r\nRight click “Year of Date” axis and uncheck “Show Header”\r\nFig.52 Hide the header of X axis\r\n37\r\nRight click “Value” axis and select “Edit Axis”, in the windows popping up, uncheck “Include zero” then close the window\r\nFig.53 Edit Y axis\r\n38\r\nMove the cursor to the bottom and right edge of plot area, when the cursor changes to the arrow shape, drag the cursor to adjust the size of plot area, as shown in the screenshot\r\nFig.54 Adjust the line chart size\r\n39\r\nClick Sheet 1, click Tooltip box on Marks pane. As the screenshot shows, type in texts, click “Insert” button, drag and drop fields and “Sheet 3” accordingly. Select all the text and set font size be 9, then set the font size of fields as 12 and the colour of fields as darker gray, except for setting <SUM(Export), <AGG(Ranking of export)>, <AGG(Surplus)> be blue and <SUM(Import), <AGG(Ranking of import)>, <AGG(Deficit)> be red\r\nFig.55 Revise verbiage and insert the line chart in tooltip of the bubble plot\r\n3.2.4 Create dashboard in Tableau\r\nNO.\r\nStep\r\nAction\r\n40\r\nClick the New Dashboard button, then change the size of Dashboard as Generic Desktop (1366x768)\r\nFig.56 Add new dashboard Fig.57 Change the dashboard size\r\n41\r\nDrag and drop Sheet 1 to the Dashboard and then drag and drop Sheet 2 to the right side, move the cursor the the middle of the two sheets and when the cursor change to the arrow shape, click and drag the cursor to adjust the size of the two sheet, as shown in the screenshot\r\nFig.58 Add sheets and adjust the size of the two sheet\r\n42\r\nRight click on “Sheet 1” title on the top and select “Hide Title”, repeat this step for “Sheet 2” title\r\nFig.59 Hide the sheet titles\r\n43\r\nRight click on Color legend and click on “Edit Title”, select all text and type in “Net trade in bubble plot”\r\nFig.60 Edit title of the colour legend\r\n44\r\nClick on the Legend as shown in the screenshot and click “x” to remove the legend from Dashboard1\r\nFig.61 Remove the legend\r\n45\r\nRight click the filter and select “Apply to Worksheets” -> “Selected Worksheets…”, then check “Sheet 1” and “Sheet 2” and click OK\r\nFig.62 Apply the filter to sheet 1 and sheet 2\r\n46\r\nFrom Objects pane, click on Text and drag to top of the plot area, and type in graph title as the right side screenshot shows. Set the font size as 16, bold and in black color\r\nFig.63 Edit graph title\r\n47\r\nFrom Objects pane, click on Text and drag to area just below graph title, and type in lead-in verbiage as the right side screenshot shows. Keep the default font settings\r\nFig.64 Edit lead-in verbiage\r\n48\r\nFrom Objects pane, click on Text and drag to the bottom of plot area, and type in data source reference as the right side screenshot shows. Set the font size as 7\r\nFig.65 Edit the data source reference\r\n49\r\nDrag the edge of the objects to adjust the size as shown in the screenshot, highlighted by yellow boxes\r\nFig.66 Change the size of objects in Dashboard1\r\n50\r\nFrom Objects pane, click on Text and drag to the bottom-right corner of plot area, and type in note content the right side screenshot shows. Set the font size as 7\r\nFig.67 Add a note\r\n51\r\nRepeat step 38 to adjust the size of bar chart in Dashboard 1, as shown in the screenshot\r\nFig.68 Adjust the size of bar chart\r\n4. Final Visualization\r\nThe final visualization proposed is displayed as below:\r\nFig.69 Snapshot of final dashboard - Bubble plot and Bar chart\r\nThe sorting of major trade partners in bar chart will change in descending order of net trade value automatically when select a year, so can clearly compare the net trade amount between trade partners in the specific year.\r\nWhen hovering over cursor on the bubble, the tooltip with line chart will pop up, which indicates how export and import trade amount in the selected market change along time.\r\nFig.70 Snapshot of final dashboard - Line chart\r\nFull visualization is available at Tableau Public.\r\n5. Major Observations\r\nInsight 1: Looking at the total trade performance of the 10 years from 2011 to 2020, Singapore had the highest net export trade amount with Hong Kong, while holding the highest net import trade amount with Taiwan.\r\nAlthough the highest net export and import trade amount fall in to Hong Kong and Taiwan respectively, the total trading amounts are not quite high seeing the bubble size.\r\nFig.71 Snapshot of the ten-year total trade performance, from 2011 to 2020\r\nIf see the specific export and import trade amount of Singapore, we can find Hong Kong had the lowest ranking for import, as well as quite high ranking of export, and the trade amount was quite stable with in the ten years. On the other hand, Taiwan had relatively low ranking for export trade.\r\nFig.72 The changing trend of export and import trade amount of Hong Kong and Taiwan，selecting 2020\r\n\r\nInsight 2: Comparing Singapore’s net trade amount in 2011 and 2020 with the major trading partners, the ranking of Malaysia and the United States (US) changed most.\r\nAs can be seen in below screenshots, in 2011, Singapore’s net export trade value with Malaysia was only lower then that with Hong Kong and Indonesia, while US is the highest net import trading market of Singapore. On the contrary, in 2020, Malaysia became the second highest net import trading market and the net value of exporting to US ranked fourth.\r\nFig.73 Snapshot of trade performance in 2011 and 2020\r\nIf see Singapore’s trade amount with Malaysia and US along time as shown in below screenshot, the most significant changes of both trading partners happened in 2020. Although the net value of exporting to Malaysia decreased obviously since 2015, the first year when importing value exceeded exporting is 2019, and the gap increased further significantly in 2020. For trading with US, the first year when exporting value exceeded importing is 2020. The large fall of exporting to Malaysia was caused by the lock down measure to mitigate impact by COVID-19. Similarly, the pandemic explosion in US in 2020 made it hard to maintain exporting business activities, which contributed to reduction of Singapore’s importing from US.\r\nFig.74 The changing trend of export and import trade amount of Malaysia and US, selecting 2020\r\n\r\nInsight 3: As of the total amount of merchandise transaction, Mainland China and Malaysia were always the top 2 largest trading partners of Singapore from 2011 to 2020. European Union (EU) had remained in third place until 2018 and was surpassed by US since 2019.\r\nMainland China became the largest trading partner of Singapore since 2013, while Malaysia had been the largest one before that. This was contributed by the sharp increase of both export and import trade with Mainland China from 2013 to 2015, while trade with Malaysia did not see much rising in these years.\r\nFig.75 Dynamic changes of trade performance in major transaction markets, from 2011 to 2020\r\nFig.76 The changing trend of export and import trade amount of Mainland China, selecting 2020\r\nThe ranking of EU fell down because of the sharp decrease of both import and export trade in 2019, while Singapore’s export and import trade with US kept increasing from 2016 to 2019. In 2020, affected by COVID-19, Singapore saw rising of export to EU and US, as well as dip of import from both. But that has not changed the total trade performance ranking of the two trading partners.\r\nFig.77 The changing trend of export and import trade amount of EU, selecting 2020\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T20:58:55+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Visual Analytics and Applications - Assignment1",
    "author": [
      {
        "name": "DONG Fang (Regina)",
        "url": "https://www.linkedin.com/in/reginadongf"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Critiques for Original Visualization1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2. Alternative Design2.1 Sketch\r\n2.2 Advantages of proposed design\r\n\r\n3. Step-by-step Guide3.1 Data preparation steps\r\n3.2 Data Visualization steps\r\n\r\n4. Final Visualization\r\n5. Major Observations\r\n\r\n1. Critiques for Original Visualization\r\nSingapore is a country with large volumes of import and export transactions with various countries/regions. In order to show the merchandise trade of six major trading countries/regions, below graph was originally designed as the visualization of import and export trade data provided by Department of Statistics, Singapore (DOS).\r\nFig.1 Original Visualization\r\nHowever, this graph is not a good visualization sample for this topic. I criticized above graph from two aspects, clarity and aesthetics, and explained the reason why it’s not good enough.\r\n1.1 Clarity\r\nClarity is to describe how quickly and effectively it imparts to the audience an accurate understanding of some fundamental truth about the real world. For the original graph, there are several points that I think is not meet the requirement of clarity.\r\nNo\r\nCritiques\r\n1\r\nInconsistent range of vertical axis scale. The range of vertical axis scales for each country/region and export/import do not remain the same, thus users can neither compare trading trends between countries/regions nor trade gaps between export and import within one country/region.\r\n2\r\nRough scale division of horizontal axis without tick marks. The label of horizontal axis only shows the year, and the scale division of horizontal axis is not detailed enough, though the horizontal axis title is called “Month of Period”, so it’s hard to see exactly which month or quarter the data belongs to.\r\n3\r\nMisleading label of horizontal axis. The last label of horizontal axis is 2021 for countries/regions except for Japan, whereas the only data in 2019-2020 is used for visualization, which will confuse audience exactly which periods of data are intended to show.\r\n4\r\nWrong chart type is used in this graph. The figures of export data are covered by the colored area of importing figures, which makes it hard to see the single trend of export or import trade for countries/regions, especially when export trade trend and import trade trend of a country/region are quite similar.\r\n5\r\nNo lead-in statement for the chart. A proper lead-in that provide proper background or further elucidation can give audiences clearer recognition of data, which is not included in the graph. Thus the audiences won’t know which currency the data are, how the data are selected for visualization, or the purpose of the graph.\r\n6\r\nImproper graph title. According to my calculation, Indonesia has the 6th highest total number of import and export trade with Singapore during 2019-2022, that is higher then Japan, as the following picture shows. Thus the graph title “Merchandise Trade of Top Six Trading Countries” is not quite proper. Fig.2 Sorting of countries/regions by total trade amount in 2019-2020\r\n1.2 Aesthetic\r\nThe point of Aesthetic is to make the graph looks beautiful. Although the standard of “beauty” is different for everyone, at least we can think the visualization is more beautiful when the graph looks neat and clear, then audiences would like to pay more attention to the graph. In that case, some subtle adjustment is always matter, for example, font and color choices for the graph. Thus, I have came up with several points on why the original graph is not beautiful enough.\r\nNo.\r\nCritiques\r\n1\r\nThe chart horizontal axes are not in the same size. The length of horizontal axes are different for each country/region which makes the graph looks not neat enough.\r\n2\r\nThe number of axis label is not the same between each country/region and data labels are not aligned. For instance, Mainland China’s chart has 4 or 5 ladles for vertical axis and 3 for horizontal axis, whereas Japan’s chart has 3 labels for vertical axis and 1 for horizontal axis. And labels for both vertical and horizontal axis are not aligned. Thus the charts looks untidy.\r\n3\r\nThe font size of the graph title is smaller then the country/region titles. In this case audiences would notice the country/region titles instead of the graph title at the first glance, which is a bit distracting.\r\n4\r\nThe plot area overlaps too much. The colors of overlapped area look not good, and overlapped trend edges look messy.\r\n2. Alternative Design\r\n2.1 Sketch\r\nThe following picture shows the initial design sketch for the visualization of above topic:\r\nFig.3 Sketch of alternative design\r\n2.2 Advantages of proposed design\r\nThe advantages and issues the proposed design try to overcome are listed below:\r\nNO.\r\nAspect\r\nAdvantages\r\n1\r\nClarity\r\nConsistent range scale of vertical axis for import and export trade, and clear division of quarter and year in horizontal axis. Audiences can easily compare either the trading trade between different countries/regions, or the gap of import and export trade within a country/region, in particular quarters.\r\n2\r\nClarity\r\nCorrect and exact labels of horizontal axis. Now the horizontal axis labels show the correct period to be analyzed. And audiences can easily distinguish which quarter the values are belong to.\r\n3\r\nClarity\r\nDisplay the quarterly trade data point with different shapes and colors, and draw the bridge between export and import trade. Using different colors to show the country/region, and shapes to differentiate the trade type. Quarterly bridges are drawn between import and export data points, which makes it clearer to show and compare the gap of the two types of trade in each quarter.\r\n4\r\nClarity\r\nProper graph title, lead-in verbiage and annotations. This proposed design includes a proper title and description of the background, purpose and currency of visualization. It will give audiences a clearer recognition of information passed by the graph. Besides, some annotations could make audiences focus on special points.\r\n5\r\nAesthetic\r\nNeat and tidy layout of graph. All countries/regions are evenly assigned to separate paralleled panes. And the axis labels are all in the same numbers for each country/region.\r\n6\r\nAesthetic\r\nGood color matching and shape assortment without too much overlapped area. The selected colors and shapes for plot area look comfortable, and grid lines are in light gray which won’t distract the audience attention. Without too much overlapped area, the entire graph also looks cleaner.\r\n3. Step-by-step Guide\r\n3.1 Data preparation steps\r\nNO.\r\nStep\r\nAction\r\n1\r\nSelect the data to be imported in Tableau\r\nThe raw file downloaded contains export and import data of many countries/ regions since 1976 Jan, so the first step is select target countries/ regions’ data between 2019 Jan and 2020 December, copy the selection and paste with transposing into a new Excel workbook called “data_cleaned”, as shown below. The export and import data are pasted in different sheets, named “Export” and “Import” respectively. Then change the “Variables” column header as “Period”, and delete “(Thousand Dollars)” besides country/ region name. The data frame should like following picture shows: Fig.4 Data frame after transposing\r\n2\r\nStack the data frame\r\nAdd a column called “Country”, and stack the data frame using copy and paste into new sheet called “2colm, re-saved in a new Excel workbook named”data_stacked_cleaned“. The column contains export trade amount was named as”Export“, and the column contains import trade amount named”Import\", after stacking the data should be like the following pictures shows: Fig.5 Data frame after stacking\r\n3\r\nImport data into Tableau\r\nLaunch tableau -> Connect to a file “Microsoft Excel” -> Select “data_stacked_cleaned”, drag “2colm” sheet to right side pane and drop to connect it. Keep the Connection type be “Live”\r\n4\r\nChange data type\r\nPeriod: “String” -> “Date”  Import: “String” -> “Number(Whole)”  Export: “String” -> “Number(Whole)” Fig.6 Final data type to be visualized\r\n3.2 Data Visualization steps\r\nBelow list visualization steps for Worksheet in Tableau:\r\nNO.\r\nStep\r\nAction\r\n1\r\nIn Sheet1, drag Export and Import fields from “Dimensions” area to “Measures” area in the left Tables pane\r\nFig.7 Drag Export and Import to Measures\r\n2\r\nDrag Country/Region and Period to Columns shelf,drag Measure Values to Rows shelf, click on “+” on YEAR(Period) field then QUARTER(Period) filed shows up\r\nFig.8 Columns and Rows shelf after pulling fields\r\n3\r\nRemove CNT(Sheet1) from Measure Values pane\r\nFig.9 Remove CNT(Sheet1)\r\n4\r\nIn Marks Pane, change the mark type from “Automatic” to “Shape” from the dropdown list, drag Measure Names to Shape button, Country/Region to Colour button and Import to Tooltip button\r\nFig.10 Change the Marks\r\n5\r\nDrag Export to the right side of plot area and the Dual Axis shows up on the right side, right click on the Dual Axis, check “Synchronise Axis” and uncheck “Show Header”\r\nFig.11 Set Dual Axis\r\n6\r\nClick on Analysis -> Create Calculated Field, name the new field as Gap and type in the formula as SUM([Import])-SUM([Export]) then click on Apply and OK\r\nFig.12 Create calculated field\r\n7\r\nSelect Measures Values pane in Marks pane, click on Shape button and Select Filled fro Shape Palette dropdown list, click on Assign Palette, then click on Apply and OK\r\nFig.13 Change shape palette\r\n8\r\nIn Marks -> SUM(Export) Pane, change the mark type from “Automatic” to “Gantt Bar” from the dropdown list, drag Gap to Size button. Click on Size button and drag the slide button to the left to make the Gantt Bar thinner, like right figure shows. Then click on Colour button and change the Opacity as 60%\r\nFig.14 Draw and format gap bridge\r\n9\r\nRight click vertical axis and select Edit Axis, change the Axis Title as “Amount (SGD)”\r\nFig.15 Change axis title\r\n10\r\nRight click on AGG(Gap) and select “Format…”, then change the number format as right side figure shows, do the same formatting for SUM(Import) and SUM(Export)\r\nFig.16 Change numbers format\r\n11\r\nIn Marks -> Measure Values pane, click on Tooltip button and change the tooltip massage as right side figure shows, note that also change the font as 8\r\nFig.17 Modify tooltip for points\r\n12\r\nIn Marks -> SUM(Export) pane, click on Tooltip button and change the tooltip massage as right side figure shows, note that also change the font as 8\r\nFig.18 Modify tooltip for bridges\r\n13\r\nHide worksheet title, Change the “Standard” to “Fit Width” on the top bar\r\nFig.19\r\n14\r\nClick the one country/Region name and hold, then drag to adjust the sort order of Columns by descending order of total export trade amount in 2019-2020, the final arrangement should be like right side figure shows\r\nFig.20 Arrange the order of columns\r\n15\r\nAdd Annotations for the highest and lowest quarterly total amount of export and import points by right click on the target points -> Annotate -> Mark…, set the font of annotation as 8, and input in the Edit Annotation pane as following accordingly:  Then drag the annotations to the proper position as right side figure shows\r\nFig.21 Create annotations\r\nBelow list visualization steps for Dashboard in Tableau:\r\nNO.\r\nStep\r\nAction\r\n16\r\nClick the New Dashboard button and drag Sheet 1 into the blank dashboard, then change the size of Dashboard as Generic Desktop (1366x768). Right click on title area on the top and select “Hide Title”. Right click on Measure Names legend and click on “Edit Title” then change the title as “Trade Type”\r\nFig.22 Add Dashboard\r\n17\r\nFrom Objects pane, click on Text and drag to top of the plot area, and type in graph title like right side figure shows. Set the font as 14, bold and in black color\r\nFig.23 Edit graph title\r\n18\r\nFrom Objects pane, click on Text and drag to area just below graph title, and type in lead-in verbiage like right side figure shows. Keep the defaul font settings\r\nFig.24 Edit lead-in verbiage\r\n19\r\nFrom Objects pane, click on Text and drag to the bottom of plot area, and type in data source reference like right side figure shows. Keep the defaul font settings\r\nFig.25 Edit data source reference\r\n4. Final Visualization\r\nFig.26 Snapshot of final dashboard\r\nFull visualization is available at Tableau Public\r\n5. Major Observations\r\nBelow list observations for this visualization and related interpretations:\r\nNO.\r\nObservations\r\nInterpretations\r\n1\r\nBoth maximum quarterly import and export trade amounts come from Mainland China, and it’s clearly shown that China hold the maximum total import and export amount during the two years, while Hong Kong hold the minimum import amount, both quarterly and yearly. However, the export trade to Hong Kong is relatively high compared to all other four countries/regions except for Mainland China, which makes Singapore have the largest gap between import and export trade with Hong Kong\r\nAs Mainland China is a big country with abundant nature resources and industries and near to Singapore, compared to another big country, US, it’s not surprise that Mainland China is the top one country that Singapore have merchandise trade with. On the other hand, Hong Kong is quite small region with developed financial industry and highly dependent on imported resources, thus it’s reasonable that Hong Kong doesn’t have much goods could be exported to Singapore.\r\n2\r\nSingapore’s merchandise trade amounts with some countries/ regions show seasonal trend, especially Mainland China, Taiwan and Japan.\r\nFor Mainland China, both export and import trade amount keep increasing for four quarters, while trade with Japan will decrease during quarter 2 and 3 then rebounds to some extend in quarter 4. These kinds of seasonal trend may be related to the types of merchandise Singapore trades with these countries/ regions.\r\n3\r\nThere are sudden changes for some trade countries/ regions in 2020. For example, the export trade with Mainland China increased sharply from the second quarter to the third. But the export trade amount with US exceed import trade since the second quarter, and both trade keep decreasing from the second quarter to the third.\r\nThis abnormal changes may caused by COVID-19. As the epidemic situation is most serious during the first two quarters in Mainland China and mitigated since May, thus the export trade to Mainland China also recovered since that. While US encountered serious epidemic since the second quarter thus trade amount decrease since that period. Besides, we can speculate that COVID-19 has caused severer influence to export trade with Mainland China than import trade, since the changes in export is much more obvious. On the contrary, import trade with US has been affected more than export trade by COVID-19, as import amount went further down in 2020.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-19T18:00:19+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to DataViz Blog",
    "description": "Hi! Welcome to Regina's new blog, DataViz Blog. I hope you enjoy \nexploring what data visualization we play with here!",
    "author": [
      {
        "name": "DONG Fang (Regina)",
        "url": "https://www.linkedin.com/in/reginadongf/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-19T18:02:51+08:00",
    "input_file": "welcome.knit.md"
  }
]
