[
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Visual Analytics and Applications - Assignment1",
    "author": [
      {
        "name": "DONG Fang (Regina)",
        "url": "www.linkedin.com/in/reginadongf/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1. Critiques for Original Visualization\r\nSingapore is a country with large volumes of import and export transactions with various countries. In order to show the merchandise trade of six major trading countries, below graph was originally designed as the visualization of import and export trade data provided by Department of Statistics, Singapore (DOS).\r\nFig.1 Original Visualization\r\nHowever, this graph is not a good visualization sample for this topic. I criticized above graph from two aspects, clarity and aesthetics, and explained the reason why it’s not good enough.\r\n1.1 Clarity\r\nClarity is to describe how quickly and effectively it imparts to the audience an accurate understanding of some fundamental truth about the real world. For the original graph, there are several points that I think is not meet the requirement of clarity.\r\nNo\r\nCritiques\r\n1\r\nInconsistent range of vertical axis scale. The range of vertical axis scales for each country/region and export/import do not remain the same, thus users can neither compare trading trends between countries nor trade gaps between export and import within one country/region.\r\n2\r\nRough scale division of horizontal axis without tick marks. The label of horizontal axis only shows the year, and the scale division of horizontal axis is not detailed enough, though the horizontal axis title is called “Month of Period”, so it’s hard to see exactly which month or quarter the data belongs to.\r\n3\r\nMisleading data label of horizontal axis. The last label of horizontal axis is 2021 for countries/regions except for Japan, whereas the only data in 2019-2020 is used for visualization, which will confuse audience exactly which periods of data are intended to show.\r\n4\r\nWrong chart type is used in this graph. The figures of export data are covered by the colored area of importing figures, which makes it hard to see the single trend of export or import trade for countries/ regions, especially when export trade trend and import trade trend of a country/region are quite similar.\r\n5\r\nNo lead-in statement for the chart. A proper lead-in that provide proper background or further elucidation can give audiences clearer recognition of data, which is not included in the graph. Thus the audiences won’t know which currency the data are, how the data are selected for visualization, or the purpose of the graph.\r\n6\r\nImproper graph title. According to my calculation, Indonesia has the 6th highest total number of import and export trade with Singapore during 2019-2022, that is higher then Japan. Thus the graph title “Merchandise Trade of Top Six Trading Countries” is not quite proper.\r\n1.2 Aesthetic\r\nThe point of Aesthetic is to make the graph looks beautiful. Although the standard of “beauty” is different for everyone, at least we can think the visualization is more beautiful when the graph looks neat and clear, then audiences would like to pay more attention to the graph. In that case, some subtle adjustment is always matter, for example, font and color choices for the graph. Thus, I have came up with several points on why the original graph is not beautiful enough.\r\nNo\r\nCritiques\r\n1\r\nThe chart horizontal axes are not in the same size. The length of horizontal axes are different for each country/region which makes the graph looks not neat enough.\r\n2\r\nThe number of axis label is not the same between each country/region and data labels are not aligned. For instance, Mainland China’s chart has 4 or 5 ladles for vertical axis and 3 for horizontal axis, whereas Japan’s chart has 3 labels for vertical axis and 1 for horizontal axis. And labels for both vertical and horizontal axis are not aligned. Thus the charts looks untidy.\r\n3\r\nThe font size of the graph title is smaller then the country/region titles. In this case audiences would notice the country/region titles instead of the graph title at the first glance, which is a bit distracting.\r\n4\r\nThe plot area overlaps too much. The color of overlapped area looks not good. And overlapped trend edges looks messy.\r\n2. Alternative Design\r\n2.1 Sketch\r\nThe following picture shows the initial design sketch for the visualization of above topic:\r\nFig.2 Sketch of alternative design\r\n2.2 Advantages of proposed design\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\n\r\nFigure below shows the quadrant plot of Tableau. \r\nNext, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\r\nR code\r\npackages = c(‘ggpubr’, ‘tidyverse’)\r\nfor(p in packages){library if(!require(p, character.only = T)){ install.packages(p) } library(p, character.only = T) }\r\n3. Step-by-step Guide\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Data preparation steps\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n3.2 Data Visualization steps\r\nR code\r\nwine <- read_csv(“data/wine_quality.csv”)\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4. Final Visualization\r\n5. Major Observations\r\nIn the figure below, multiple histograms are plottted by using ggplot() and geom_histogram() of ggplot2 package. Then, ggarrange() of ggpubr package is used to patch these histogram into a single figure to reveal the distribution of the selected variables in the wine quality data sets.\r\nRcode\r\nfa <- ggplot(data=wine, aes(x= fixed acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) va <- ggplot(data=wine, aes(x= volatile acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ca <- ggplot(data=wine, aes(x= citric acid)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) rs <- ggplot(data=wine, aes(x= residual sugar)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ch <- ggplot(data=wine, aes(x= chlorides)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) fSO2 <- ggplot(data=wine, aes(x= free sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) tSO2 <- ggplot(data=wine, aes(x= total sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) density <- ggplot(data=wine, aes(x= density)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) pH <- ggplot(data=wine, aes(x= pH)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) sulphates <- ggplot(data=wine, aes(x= sulphates)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) alcohol <- ggplot(data=wine, aes(x= alcohol)) + geom_histogram(bins=20, color=“black”, fill=“light blue”)\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T03:32:49+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to DataViz Blog",
    "description": "Welcome to our new blog, DataViz Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "DONG Fang (Regina)",
        "url": "www.linkedin.com/in/reginadongf/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T15:04:49+08:00",
    "input_file": {}
  }
]
